scripts/backend/jmeter/jmeter-conf.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">20</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="false">
          <collectionProp name="CookieManager.cookies">
            <elementProp name="__Secure-zerp.session-token.admin.0" elementType="Cookie" testname="__Secure-zerp.session-token.admin.0">
              <stringProp name="Cookie.value">eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..tYe1PDF84N03L6Rm.EwOv0xkV_IOkQ7Yqr0KxdDEPyX3sKp636yCE_Hgq6yGX-I3z7xqHtLxXsa-3gUQ7f2mrjAsd9hH4XmrbOV86zHK2KOnyvLKpGj7BJEQ1u0PIQwFf_KNgC7nG5vq6r2PD6nNWw-eZzStxZhJPyChhrphDnO5uHvj7_6zb5RRKEm-dKdLJIkykc7Db23GmcscTNam-ZY-0-AYFUAgwjGVGWe8el7DYXmZMOsoEqxAPG9nF3zvfZuTD6xot_PvfHvBa-vNaN_syIpjgZxqkG89jXaMKtEhYd0Qg8QDxPLD1CHAhYJdNn-dn_0rzGaDuTQ30FXYlmTs8jsSvFDPgcZGkVO-WtyCnchOXgnDdzeSsQ4aQ7g_Mdrhf0dzYOmjO7p0mJH_qH3f3gHXW3fy9v5mh7hwhGzQp-EwXd_2oLzBHyRMZkrkAPqe2AOzkQaYC9_xIOa8OB3qowDrnnsyxbNSw90b3VbpMf9174Jdho7-1trjxlAz8YKEbM3XfUsVO6UthV5mDJATkNGbNZAMVFapvc0bneuZ85ZwRPMidwWH3O_iE1XOzE8svs_zOmKsewzlNE9FLNdeeKYes_osWACytJ1SD5e7ITbzzJ1xDP7CrCnC-ySIEgLTTJWTVqAkypQnv8Yttohg4jIjE4X6w2sQjscLPRFBvoTXDIHnoNS8kcTC5MmgXESHH_jAX5y4ipuc9ToQb0Se9JNBCltLaibK_niIkjtVrL1gZ3zyzSvmYWwjwKScWT315VglD40mHn4uUW4J7J3X7lRk93rTeT7LGCYcSnT3mrvP7yZPOzGr8KshfB-91RrmEkcmroeR2JnYwqU1eJ2SBAPgHGKpAJXrZAPdmLYxvfelhJT8reAKjZft6Nn4jmaP_Rfiu08X_Kj2489Ob0R65qjAoNqFM0Vv1hjk7hCjLNHmHUyAaSKRYSKdzDzPpW82wKZZ0xhOsEVe1SEhpetdHSvpYdWKDmEGdUxwvbUdxfeQ2UGL97t9DAoRHwDZrfiSlC4dlDrUFDaSFIgbqhg1sltZtfpQfucyunsxf9-xge6DgU9r-s1X96o-BdUS4PDPx3VISRE3tbSZ7nsnGUvxuaUQIFH9xfFwFR4fTDrMfkd1XSZGGsD2wqavtxCinxXBcrqnWavw5W-HQY6gF1WX4WrxFA-Q4eD8dS5ZA6KXQCoz9-o2gDOxyy5H4KkZ6FhkDPiNoASjaZKFSlRR9C199-rNqzGhgZxVY6dHW3NDZIzr-aOsThj9WUMxVNgK4HeicjJu3Uv9Wb996xgbIsl6zHhIRRRh2yS1ZRxxh0zHWi8jNOha3ZL3aLIJtzuropqNnEDkxf2cd8uJFmi5Ptxks7XFUZrplWVJsYYHiXiwWLS2BqagspIid8F-6CPYyWDlU47xl2zuFwAi6wuirnVDc0QPNTBFtCYaVEgG0YNZH2-5wbkK-K9mtuYQobWc04g2B7H-LHRNXOWvwLHKPCxASC6_MkL7Tifxtt0zj9qhYgdY3oQQcIgY1jR4d9TW2D2-WLkQBpQI7vqs0Dym2e0VAh6Pa_BukEzaRxP9RMfMXoXjTRb5dY5UiIcxkVZFX7hqjmaJInTCp81nr-ZbCSCdzJXOmYA7XTcJI1bdVbcSrC2-k3XP8qruh6F165aWCfNz_goipBIBjskp_8ia7kQh1Yo0pCz6swGfiHGdDsTfFUw_Ule4bbHH9yqWkC3Yn7OhznO6LGWneFq_mq6-f0OteaDpD07TIiVp-f69_CqztSxx7WyaQVHSQRwgAkmNvv_hnMPVJINYWWqj1mccZWeWZZyRFUATv9rgqL8MDHbCKKY1osqwled5YJKa2DG9M2Ig93psqC5ksGfD4Qzdp8VbtRyV8pbvWWHotuKa4PQGpg4X-w6q3Rx3tDBjLRVP-_x3ClUJaE3oneKicKbL_RiCSZ8Z0sGbat-vZhOlJHPS4HBDYOmHwrX8DQ5qZRj79Fp_EF_9lK3HZi7YLqCgOHTpmEU4QXJRhrOaLFWaALuJ3M2kijWw3cBCM86IhxLuWLcCgaT5OdbOp-p4VrK8V4zV4zbY2YdeZPeHuQMkfBSNIZfCS183_3UGg_OvFlGG1j4YzyXRlIqbDz264HbG6is2HhS2vpCu9oiiUqG-kiNqQQHmLSla6zptO9XYPw0ep4Ke3MWxQFEDM3vEloQzTzKY-rwGe87M5mRLtXLAJv2YFFVE7Uey5bcznrP5BrwNYq4VNquTy4Mfyufd6iHlVnQa_ji-w67HLqUJFqwY4vAYsy9czHnjXJw_gHpTWnKor25TA411Knh4ryderduz7KJf9dhK7lEl7iAx2YLxsbx90DOz_Urq45WZq1mvmUvpV5bknEpF_h-XDYt0QkzRSfuT4BHaErkiEbeMaGULb0myoSiV6bpd0UU8Sj-YZOMZy8xnIlPvJ8F1WSV2yLN4NpccHKUYdxOuDJEEihktIPQtf5PiXNONlgfsGW_q-R-z6gCpcm7LQHzO2yzfxMPDCtJnqHmWD90wOPZoCR32iLXzHY6EShR-V7AbeYWzZRE9xjKlWxE4BizlJ4baxUEhSlK_SCY9JL7AsDQfY9YxWW4m7887WAr_7ZcEEn0yAwp0SHSGhl2HjTNVhVTIe9lBgOzh4TWYLgXQsCqKkYVbt2zSagBFkW0vsefkLAtcd0ueaMtQDXHppB48ldoeP4O3ABtGYoZdKEoPhA9tAUrC5tUStQ3uYqGLU8cETdqgA_yXHTFleqCIRQD4Od_MhUanlr8BTS1SZubdCkE2iRz5aeab4X0SSbVO8qVYIDMX0R301IuN4YsSJU4bPNgQ0twChVJE0bUthabzs22k78F4b6SLdTo3odtED6RcABTY_4pG8OXPZrtoy4KItcGdVxg_zz_EHtCqLtsKID9nMR-xNfWMOt2nRdgLsgfNhRfY__rxFVlhfxVJXiIIJry9gU2Sfq3F3hzE5ffBydQY6eSO4efynQ9-roCAH7_qSGegaqgyo4cp_tMYKAEqPRm8Y1FmYxrCEtiVP516F8NEh1CmbJXCmiOwoDk96wW2KXNlqGKxOtLpwAxezPoRh1R4SZBZ8YRF1JA6iZ8RYrcp2LjfQfdnp59KpESrGwYD_GA3XSbuqihRu31HazTaxpiUCmX3crac_MSsbfYbXHHvnlzdPqDGNLUjKDbLxThtvxEjLUdFD-YNTT6a-rGN7PUcUF-wXUxiVBvTRresbGoGM8ArlFa7LshC2FQV-fw4I95GmeoeN4u02shx1nVa6env5RZA3mlkV8oQ-gxy7x1QA_IUR9IKrqbKWJFTKKo4nbGNpnzab6IEuUaFFiF1ObyMwUKhTrb9QRhIZl8HVKPs2NNt4vcXaTZ6pcIsfpIWN3O3LsdqAbvMRp1O1WyxdsTRGFdwnB9SdLhS3bdRdrw87r6GYYCGezPZXxvkFl4s6jrMnhOo5Hh8MRorUZmcu2HgWardoJIJM8hUY_Mdl72NHAaB50Njas7faNR2g3ZGdN4dgOIRUH1wuhJ_aXxuegUJtPQpNhYAsnEiCdSc26hgoL_HZxhOngNnRB_py4bYwuxBxVS50qVnG5VDCkQUPKSORLIDijinwaRA4gZAaJjGqG6X4fYsnjX8X4q5KawObMRNJ-ObOQXXehtmcR1zJbBawohpmAAznihKdRG8IF6kzshll9EEH30EUjm0_1VeuSbK-asZnE2fbm_vWA2DJsweV1rAyWAMRY1mnklTxOuYrYqB-wvLZphbkBod542hEoxun62n3BWs64cJAznQ20uT2Ro6QNlM0rYg4VrjAGOgWCU3crKY_VqRN_v7KF2SmxtGBBZx8sfGUCEMVWgoSpVlGtyo9C-glgR7ykWZizQY0d92t-5AyqBnL-Cy..Eu0v5wxSIQb6CNhz.HSi_FfKDOxQOPaIuBg_3b8gZKAB6aKjbfgsBpOx08MK9WiW9qj1K2jNTlHM-4aMnCFSsWp4koFBDNwyiBx-iVx7YPKqjqQPBAI6HJd9aSHbaK4kpLEkHS6HT2kLww9jFcWC0i1DxxnF4W-T67u0ZoH4hQRc6hdp5j4boYle79cMzWxOGuur1JFWTJon1QHkjzuN5ONgb2j7LM2h3lGAor9SghQiWG06Suaht58YqXaOlnZn804J2IV0pG65ft7vPDBT8Ddmd0swrX7SiPuxSc8aatkuFCJyQzcuFJD6NnF6veJ1JTA3JHkiEf4CVf-tc5iX2lkUEW6fyDQRzcAKJaFndTyeamGqED4au-sb2DqaQIQCwma0CD03ed-LynErPE6dg7SJGG5FDbW-H3FESBuz0hWE8PuI_XOrjWnUD3xVU0nJOZwacrqHgR8PiAmShvJxfcnoHpQHC9z0SkvvwenySdxzdiGmhquBcxIVMgmFG9KbEgBsqwyN1rdS7Dl15zMdi1G3wk3r8Lq2qRSWL9CZ_PZkWIrJ0RRfY2VSIuyrbm0w061ffip0EUkYoeR41PVPa0IJa4V0vk2YkEjh4gTdfvdObGfQ0TbP1melK75q2Ay5lbgG0GDCuUDhfg1bRebVW9qRUqt8tnSqyXHpW3CDycIhyeAx5a1Q1_eczPUWKcOOqDJ_fDMsXFwMyA_Q3b1TjtNc9MFMt4-Bt8DBZ_C0l6L8MaNN78OxlUABH5Jgea0r8ePttO_OxWG1o9U79ItVd5YlWYCedlwCkc6mfYuChxZi8Xt_RXgWxvVyEjL03O_mNSjlrUEGYyyltkutrdOmn5RPl62aErXNBtJlu4oc-oY_R7PXqABI5nfjyevRJGTIC1GGXKMkYwlYU9zaTbSuJa-V2ql7MJbSEYcjK3X8AUrqx-h-SjKLkEwTtLMngMovjuBK_b86ocqQl3AESOpfuET6_iGAAKm1XZii78RqIiPCGqgA7Irx6ea8GelVCfoEZg-8i1GkdOvi7rq6y0V5TcevJiK32xDXJqMqMQ3AbUG4gM6fm1IvSyargD8giH2DVZpsnu4t5Nuxu8B7NqdXgTF-NiKs6y-Qm3em_VmvHsOUD5JcWcDhqH6fyPG9S53fy4EZELb-l4wToL1W4AZNeRKDUacFChhqEKwJxFs6U-aqIKZg5fDpYVPUsFFHsEPcv8a3LdnYRWokYxGxFeM6QsVOo2Q2u5IC0eb-4JYvTmNYtV4Lz2MIucWgxx7gystehFwGJ8Q10p0j9y5zOxVCj0y10aN1xloQgTk562yv1Avm1v0ezuuZgHAB0qxah9o2UGwu-ruDjed5WbZ_ZuWNLNo-Dq_ni4WirimkwxGYPGdvXFN5n-c6VoO7BRnKs5h9a-0jmgDeZSVKdoKva4K7pRUJHWsYKR3xMHKgPL-G_YUws3cSGzNP2fNfI5-zr6ctkFr9CBtg0ALKv36zqlmowbPCtzkqzqm7xeywpB9-VQNtI4Iem4L4zWL0DWsUHKp6925NUR0Hvrbbyjve9gqdMv7YmrOXXjaDM0era5rsoo4I1qdcnkda--hdKtr7QKoERw29AyL-fSFZoQlLW6H-3hwfqht9MkgGg-qc8fr3w6ikJd9Ul5S74SyjCLpriUAQjIAdoZlm2msjR0hX7fgntWc_YaBHD0qcPXbXgnOvzk-phAUbWsORU8SJfeoWb3twOvZV8Km6RFoFiFLENjMLHWYU1QRJ3_klhPQDiI1-1qsa3xq162TCt78Da1RmigD4I64Nvnas_5VdFhP3iMdvD7__yu08WN4lPzbO88ha4zEryEMrFMeHh7QkIS0RxLMnYg5egd8Za4fi9pVn64YlmjVMeXfMFyo6tuI2SG4XLb37X6lOUeuOsnQxxCMM60ggVmZrF0v9g_LUB-zSU4lQ4ay_WUc1kn2OBSkRIskDgAI7qLg1D1oucBYVUwU13APq5E8TODU_0j4kCQEQ4CMYzKpDbVtFSdIKRkjF56oY3dIOsJkJxSWN-wujRpIXqaA43RPOogZnphQ9oPKOYblP4-03onc9XLvXCaIm9J_mSbkJg_NVyWJ9_VdWOuhfxPhXuBqeiFotY9T7wRvc0I044_2zvJ2irKeRZ4EoTOAIs4btjsVFaHvH9O_5_trz2m3kdsnUv5ftS3DligQmGqPiE5MkYNGxIPx9sYVwfS8ZhHnrYQ9AabFzuIYtdEXY-W4a1UdIznAQfQ893zXNKHzlfVQSYd6gIWnrjsPoh0Goy5CPAmskCBUSTNN7CXGorBzs-vw4i_Q8OzBUWmh1C-uZjHP7roMJRFZcznS0fdAHb4uAlxzzc2leawKasNhJvPx85tjxUloZy35HSh_0Od6zoXPq5lgL6jOALf7phU1Hyuryc9xbdOwJ2VDG-vYc-K8lSLRrjpihtlhSIDK-LS3qUSVaXeMjgYtCvSle_OIA7buxVnfuj23RpWMptP-VORKvF-ySAuYTSzevqwJx7IfhqIHKRm8_4FXEVWhvIE0bqFhOtGIgNGuZBsMyrNzOP8ILN_5rYmBUCUwFtrsUYM0w_wsEE8RX_zA1dqoEhgNaGGmbjwvVZxrYKyT_wMMDPMiC8mHl2SpDJTOTh5cpGPOAUCiPAJ8m-fM5O6LQ3LDpkTsOOb9-ncC8DEjGxxBCwcwi2GSpR1E5MvTn3pKOIXfB6Y1B6HxlQYHU0jg_AYX60HteSkXs_Cue1ecnrLkvmExdP4m0H7M9Pid3Vv6VObJtT9e-9FG7xP0tziap5dgr-8GSed04kh5aojajxNWKHFxUuTJpe684YXaFMybFHiJbH6HP5uHCnHtU6FIVjUn-_z0fNYmEqetL4_hYjxGIS5eGWD2ZcVdStxrCD-tEcMVSfSz7YbQPJx0q9pS-d1U2iiict9fEjMCOYaTNuVw6xFn7dCpjWXC4C3Rft4PyG_wo1Z1GximV8GsvsBJ8oJyMYcI-8VWMlvi0Q4vg4B8nIEANEWnvEdzknqnPo2ijiXv7YYn4nzx9IS6ZCaNMThfjS7saNRQi0koXyb4G8LguAH4X1iactRhwuVz_Af2whOfE7G_2rU-ipvm3zIfl1bmyg7hqPN9ECDrMcHLGpypxsJkAKiafUofCYvOgI7WHjC9LHG_4S28WY1_B-pb3rbJoMi3MvL5LSoaGbgXvIh32ov96OAXCEJESVkPD20e5rC2KgvenYN6v1BWEneEwsJ7L1M2ay-XyPrQNfs2bAUIcXTCf7t-C5uFMARQEhCVfP9q-_AN8mWbg7TLAYoiErcHMJogioSf7yosmNEFpJ4G3wFOy254mODZAZlL6RNpPtwmmi0auxcrxIYKDJDgCHYnsohvP8OOZJGDbePKCVOiuQVJ57j8k5q8druFtT0MbpywyhrR9X9c_OaR89s0XGW5tEmAFQroUXryGqH2aag174EkRCpHlP4BCtTgnZ0QHfj7f5JuM0n_Wc0wfIiyBBadHjSRBcl8slOE-eyWW1DyEDsr4wBEH5Wbd0XW3z9G1flGqltiGVec8u_XoLB0aF4qg46bAp8trrW4QUSN7134Ny5J8O1CMQ8DZ-CaOG5oUR4YB_g3Fa86mKUdfhiDpV_HbXl9xDYcE9hze9SXvqpYRw6oHMc7raUCJ3gALvaUXpygML5fBzKi8IqEEUH9q71V-WnO1wRfLffBtcCPI_PvRrT7XVSzRNM28zrxUszRdnUN6M_vjvXMwvD2a_3kmU2IL0pltBPmmVCpK2UYW5UwqopHvRS175K8gUOSRKauc6QM2So7b03wiU1C_RcPcEQZhd5hBbmUn_uWK8V2yY9YHz69TvDsg1m2rhm_hjfIZCcNG_DUpnzTnQhlFsxBxVZGsCAz0fucwXOe3</stringProp>
              <stringProp name="Cookie.domain">admin.zeerp.tech</stringProp>
              <stringProp name="Cookie.path">/</stringProp>
              <boolProp name="Cookie.secure">true</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
            <elementProp name="__Secure-zerp.session-token.admin.1" elementType="Cookie" testname="__Secure-zerp.session-token.admin.1">
              <stringProp name="Cookie.value">1R43dazRbYlq-yRWlsRzwJlTMpkHgsqPkOXrisK0BbBLYSxUpigo-CNTIQIlkWBTg5PTSBl_BTzJJFXpSjx5Om-Dxk406ckJwJzQsS78rXdox_guvSF5gIyZ5B7uiMGK0_q8UcHqhJRg8dMZBM-5Njju7OguVaWXrtH2WyuMwGYeegjEi8LwXwGzHnafBZQ0xs8UEl3qx9bCwv7Vu8Rk6Qzkplwr-ojXVgH5NtmM-4zpxKiWZqO_DZYADf4sPqM1WPQrBYM2MjoDQd_grwI85Jevfxk5fEL8sbsf55k5jyBwEptNu0XlIlt37Rh2vUHC0NlFch6ndw6hPjBOYLXQ-smGTyFUEIPyAUeYaeSpPj3ueXB9_5sis-H8Kqcd8xVXmLJgIgbeN6uTRTF-g-OlZNa51004Ms_LfCbS8hSds7XQjqygu2lEirOxDc4NMqos1OhQiQU9u2XPFKcsLXEiL4JirZr1Fwku_U10qV7VsVuheaoMAeg9BFWpKSw8o23jZQSwPUTz2Ep8L_dJ7W5w43f1TyPdQex5OVVN09HmfzUXoh1ohTAZK8b0sQ0ZqaJN_DNsO9VRlog3Isj_uhPE-fwCfJQvSrebhV96EJ2TI_dCRe16Bl3rZS9NwDi0uuTrzpw5KFKKy0jjTmiaPhezMjA8U5SQPXxEtR653pvbksh3OkJcziJ9MZACii94nfb0guPEXwczj3NhqDpcAKlpgdUZ5Gb8ZNtYYr8IUsk10URbgu7aWAwAowoV_u_80ZwZPnrE_fJ5IcIPRa2QIdlaEnhrn_L__KxVIsOliMVqjYc8gi9Xp4DhrOq8ekJFCu4wVWpjwJQHOD0-KTvMAOh9Aw_YN6c2h-hpfGBnyXetZwNQ76LV-ezuj8g_b81QyMgor5TJoNCxObF2BuKTfhtPtRh2J-cbnfB8EsY4TTh2E1GrkthvETrcMPxQ-jkPUYOLzkmS0E_42V_J5tRg4A2IZPGjS_pRLkixVcpbyiU2uOY9YSPraJLHKsFzjLeGkYO9rbIaX236tKYRhtZvxOnMpZyb8uALNHX_1GCvEx8RYtgOl-1xUhTcDem4pDVveDGpRa2YT4H8SIdwiEBkzGmOusexSWMwC4FKOgWeKfYtqaPfp_ySLndPjLd5sgIVsKEI5X_8O25ecItLLOcEaF3ziDJ5nqrQlzU_tHBitY8ekO_F0VdUXFNbejGpIyb0PcUq3976IXSPBI5MIQnMqcyVYVG09d7hRohe6IqNwlix7W5bL-5-R86GW4zz153F1Hl3l1yPfH_YowQMeIGfOa4A7-Lxvr7Txk42FnCYC7nvrf0rgfIL2AAQDPCdnC9_vV0mUZqskv_81GQnUEZI7u5rCOT2bgqOi0otb4BCE0uXAyHYcqXle8d4rB6Nf2ZgzK2YtTX1LAZTPWy7S6GkRC8RMBR-udQBs2SsQWIiPswez92gewTasLNJ_fGX5Yg5dRMSVVfCHJhu48vyQbPRAq524a_bQANqy8Pe5ELSIkuZkAJD3ZjYGLLrhnf65q3Hx0PnIvLSl6kY91y8hJ4uEU-UWEpyAoCx1iVNsorKxQRBxOWUJ89OJfYdQgnP21ilG8cBrgiVrXoo8yHSybup9obUl4k8zjYL4czu1MnV77xpIbJ5VSTtfIKYVutQXtpbQIkK6qQ2kiUT5MjWP-LLppxHFc9pXIwIn_qrLpg-3B-BpuXH31pHtNbT5La5jLBhwP2lD2NQn9n_YpDWxfhoBj0v4_tiKn_pIi8iiZeAl5PgUnCtWD1MGLekZpyKyWgxFvhK2zwecC-xoUFb9OxubFx5dYIipcot2SdcY2EqPpQOxWvM9jQTVD1p5Ysb5_bg1D_a1mVkJQ3Jm9eRAwuSwojcxWP7Ji_KVP0onX07YxYNO1-iIC4Vgu-sdldsabHDOeD5NvUt9lUVHAjHoCnSkx8CwAzG1GQMXVsmLtjLl5rs81wA3wNlOMV6A30LcfekSaLnA02-QXD-4rHn_J3rjj2CtGgNTMkX2ko0_57ahLKX9AAAbHQeNB9feK7OAPorQhGqkfvN-hDThGRn9so0nv56IeyOs4d1QovGOkYiDgD1P0JupNTCE7nnLu83YKzRbp_JguJ-uQGUX4m5xrzGwl8pC9Tjq2NQOEn_V-I9Wr5n_dssI1g8e8FRNUxrswmQjdFruuG_7YK85PAdum19-FqgVVwt-E9Gg16-8RR8S8XiNYaIQhLAVUthCi5VuWNZndfkvixGVRU8bQMf-7xeM4L-FNu7-qOq-5vYxEAiGtS5S8xQqmnnaLNd5usMMYDtJBsexmbl-wTo1tLQfHoskCKPQXZQlWk_BCBaXP5Q5VmmOAxMb8sKm93BlWyKnWuELwgn4Zt2HGey4wIb1ebluMWNyoK06lHL9HfcYKH-1OoCKY1ssPHIbtcnl2Ga27POk8DQraQrCOLh-mINACgb1DxB3Ni3iEfzNiUJD3wmBwXFE2MdBCnjbrUL43sSi3cz0mzst4em-cBLn7v-id-QSMonuKc3d4lRWm-wY51-MmFMkV55r-bVH1cLMMxnn2R2ACDlhbUwkdVxfShPdyPybDdEjyRdtvE-8HJ_q6zxkMmOoKCHIpCPdJ46JhZRZ4TMZpNe6StLctnMS001I0qIY2voArB8anmjKKFrtq7vwryKK5DvVR-pP44_IZ3jXKwrLXQMiD9hCdMhdOBsPle-NpLr7BzGByALdDKfPq7nYRySQz5yXBxwWtZoEXbDkvdduWHa1gZ44k9QcFGg5KOpzTc9V6Ei6tQTlFrVsCnVnSbGiSPcZ6mwYpxJiQU6_TzRcSI08dPv-0GzGIvfdq6jDHo1SxRvxOuijPjqrGbMfc0vhji54gggnzy8fwKEG7xcEbKhA0zJD3rH6ITGaqSXqCXOVnSG2j1jRaXCpCX46Dma3GlWAgPz2MQjZLPpE-M-EFYPKwii3Kt6shYRpLZy98v8f5Q133wdXHlB4jP1Ae7Kf4ZY1bIIorpp4AmTxHhIBgQOiqGiMIhlF3YC6t6H0PHcaLN4lHNNByk1zmgs98joVWop0jnnP5BtX7y9wMPjUPSYVuTkGapo36gYPubNf1Qv0fRzou9zmX3DQ_-4m34llPduWgIMAr-efNh-Mnr3_8bmN-9t6OdsopHTMudwGTSUXGESQfghyOsbiaT3XqFE_Z5rOIvha0bL-u3p_xmD9IUaST-FPoQCEKZQ20Tyf2jvgPAfRz-6reU3xidSZ2kmNpOgp1I3NbIaE_7TyHKiAUHV2BWydGbXbyb-pcvpQWuPnvVjMSASDeSo1NXgsWV7iSJyOpLeayVVVyQam6GAw5jzE0S4xy9RkSRyo-AUMTSVMk0nwzpP7BmOrN1Zoc6pEq-LX6YWL2eHF_QC9X2H3vA0eqfQgjn8gH8VoZA9GKSCXxYghnhh3b4jynHZ5kb__7afYDEcjcUBtC_1wbJeHiBsobZYAEWbSyG7KgJBMwZTLnsQKC8EAZU7dqWiEwRCnSrit_kIFyY766_ctDrpJ6296wwoXSF3B9g9GjumqATdlpaGSQRzqjM6R27k4xd2jTYDuxKbIIQURJixG3PGw-VI3v91-4j9noUDxwVZFIr1yjkNyQTmt0J6sluAtiJaY-3j3-kdHvV4keTAjs4ntJ5KH-vTYuODYJuTWGlQjx4XTjbwQLwqBueQTMiXfMKf2vzL3S6Z_psR4kpGGgJeLKcSnP1dL48VZIqCXk1-EGDBlbYCHazo08DYeHrgX-CYML8UJ3UD0oHk1C2RkWzs586kyR5PVj_73XZU7pAieyua0S-yv61X9aW5gttQlVptIM3R6RbvzdME_RUISid6nCzTsWQYCyqktr9pOzPJx3xIDE9s3sb_qZeZCp_RqWMIU_gJq_E2MFRFyuRy8nJkW5xsuP9D5k6sKcOSlmti6lshwLt-OsVfu</stringProp>
              <stringProp name="Cookie.domain">admin.zeerp.tech</stringProp>
              <stringProp name="Cookie.path">/</stringProp>
              <boolProp name="Cookie.secure">true</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
            <elementProp name="__Secure-zerp.session-token.admin.2" elementType="Cookie" testname="__Secure-zerp.session-token.admin.2">
              <stringProp name="Cookie.value">w4_6-zcNSMwKkWaBLzp0ApyBjvTiBHB95Izv4j6UQV47bK_CQxleLfTeGQveL75-n5yEd6VHy_yFxro1LnzCTZdnQ9k5CmJsFcv05BSuIHw21q5wVShRzTND5QQjmfuVtsM8G_Nh8-Yjr_Rr_faq-k9PXYlfndiHU15IOnlRErm1CIdhGz2e5l15r6O5wQHemC6znoLw1CthMO5HnnQFNYOADYwrzdfYTB74VWFu7AR9Oi8qFIMZxIK8iM57fR6G8z2Bc1825S2Uo7xc7jKz8EtcXbjNSFjkRAWl5O71L7vSdKtypOa2HEs9VoewmPzHlDh_KFhEFhY5Sf3Y4CoduvY1PWxTa7fX9Luc5qRIBV1kgDYXdr9lwCD0Deb5-9sL1D5bZS-PwWc.6_GERU4WAj4ZDP5b2xJRow</stringProp>
              <stringProp name="Cookie.domain">admin.zeerp.tech</stringProp>
              <stringProp name="Cookie.path">/</stringProp>
              <boolProp name="Cookie.secure">true</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
            <elementProp name="__Host-next-auth.csrf-token" elementType="Cookie" testname="__Host-next-auth.csrf-token">
              <stringProp name="Cookie.value">281fe65eb6d89325a6d64a752b0d913f1aa8527539262adc82b74147cac0e035%7Ce831be217b9ab5fd32dfbf025891458277d84221e2dcb95182538bbab3d6325b</stringProp>
              <stringProp name="Cookie.domain">admin.zeerp.tech</stringProp>
              <stringProp name="Cookie.path">/</stringProp>
              <boolProp name="Cookie.secure">true</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
            <elementProp name="__Secure-next-auth.callback-url" elementType="Cookie" testname="__Secure-next-auth.callback-url">
              <stringProp name="Cookie.value">https%3A%2F%2Fadmin.zeerp.tech%2Ftr%2Fdashboard</stringProp>
              <stringProp name="Cookie.domain">admin.zeerp.tech</stringProp>
              <stringProp name="Cookie.path">/</stringProp>
              <boolProp name="Cookie.secure">true</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
          </collectionProp>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">*/*</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJ2V3pKVTdJX1BzbHR4Q3JwNk1jTV96SnZwTFY1ZXk5VXktRkJtRWdxVzZ3In0.eyJleHAiOjE3ODA1NjU3NTMsImlhdCI6MTc4MDU2NTE1MywiYXV0aF90aW1lIjoxNzgwNTYyMjU2LCJqdGkiOiJvbnJ0YWM6YWVhYjU0OTAtNjY5Ni04YjMyLTNiYWYtYjgwZTNjMWZmNmQ3IiwiaXNzIjoiaHR0cHM6Ly9hdXRoLnplZXJwLnRlY2gvcmVhbG1zL3plcnAiLCJhdWQiOiJhY2NvdW50Iiwic3ViIjoiYjMyNzM0MDUtMTYxOS00Nzk5LTliMjgtMDVkYzdhZmY3ZmIzIiwidHlwIjoiQmVhcmVyIiwiYXpwIjoiemVycC1hZG1pbiIsInNpZCI6IlF5ajJabnA1em4wbXc2Z0ZibnJvaE02dyIsImFjciI6IjAiLCJhbGxvd2VkLW9yaWdpbnMiOlsiaHR0cDovL2xvY2FsaG9zdDozMDAyIiwiaHR0cHM6Ly96ZXJwYXBpLmZlbXJlay5kZXYvKiIsIi8qIiwiaHR0cHM6Ly9hZG1pbi56ZWVycC50ZWNoLyoiLCJodHRwczovL29hdXRoLnBzdG1uLmlvL3YxL2NhbGxiYWNrIl0sInJlYWxtX2FjY2VzcyI6eyJyb2xlcyI6WyJvZmZsaW5lX2FjY2VzcyIsInVtYV9hdXRob3JpemF0aW9uIiwiZGVmYXVsdC1yb2xlcy16ZXJwIl19LCJyZXNvdXJjZV9hY2Nlc3MiOnsiYWNjb3VudCI6eyJyb2xlcyI6WyJtYW5hZ2UtYWNjb3VudCIsIm1hbmFnZS1hY2NvdW50LWxpbmtzIiwidmlldy1wcm9maWxlIl19fSwic2NvcGUiOiJwcm9maWxlIGVtYWlsIiwidGVuYW50X2lkIjoiNDRmYTQ5NTQtMzgxZS00N2YyLTgxNzQtMjJlMGM0Y2I2NGU3IiwiZW1haWxfdmVyaWZpZWQiOmZhbHNlLCJwcmVmZXJyZWRfdXNlcm5hbWUiOiJmYXJ1a2VtcmUiLCJsb2NhbGUiOiJ0ciIsImVtYWlsIjoiZmVtcmVla0BnbWFpbC5jb20ifQ.EQ4_h1wrrgL-wQy8QM8YVoE8IcKcZWWRlPEFSIeO3r4iB3kKNMzd2qCQyJKOWulv6HwKJRem801umKScpYaT3oupa82GDZL-MbpG3Kt0yK0NTGptSKK8us6-48xkezWGVEuka0YnXwtbp27lM3S0156EFxhnYCvh5bJDTUy5wLWo4en-vQyRuVjphgy8N2Z1ZrsbipkToDDCIBIrevkO12nwX2PdqIlDuqfZl_osUZRGUqudWkHbdUaGxcim-mLMmDaz4Wqhz3YcR8GtWc_nNGjp6IHeIA-LldBJhg6LFzEsvocas0GoJnCFstDTR6CJhjj4AxfRdUqWlx35-FN8Cg </stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Throughput Controller" enabled="false">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">1</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>1.0</value>
            <savedValue>0.0</savedValue>
          </FloatProperty>
        </ThroughputController>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">api.zeerp.tech</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/crm/teams?_start=0&amp;_end=10&amp;_sort=id&amp;_order=ASC</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET menu item">
          <stringProp name="HTTPSampler.domain">api.zeerp.tech</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/sale/public/shops/ac467328-c324-4ea8-8995-279ad04a5393/categories/ce1169ce-6801-49cc-9093-a68dfddf6af4/menu-items</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer">
          <stringProp name="ConstantTimer.delay">500</stringProp>
          <stringProp name="RandomTimer.range">1500</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>